---
kind: enumMember
id: F:Autodesk.Revit.DB.NavisworksExportScope.SelectedElements
enum: Autodesk.Revit.DB.NavisworksExportScope
source: html/5133006b-034f-1f05-5b8b-37aa7f12c4e0.htm
---
# Autodesk.Revit.DB.NavisworksExportScope.SelectedElements

Export the selected elements.